#### OpenTofu Plan 📝

<details><summary>Show Plan</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # oci_core_instance.k3s_control_plane must be replaced
-/+ resource "oci_core_instance" "k3s_control_plane" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.ap-sydney-1.abzxsljrhlun5cmvyw4mtowjeo6kn5pir56vwdhjhgnczisme3wijfvwc3ka" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/sebvaughan97@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2026-02-11T07:16:48.475Z"
        } -> (known after apply)
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
      ~ hostname_label                      = "k3s-control-1-vnic" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.ap-sydney-1.anzxsljr5es2p4qcfcu25canpg6po352gsn4no56skjgupre24oaoe2jsgda" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.ap-sydney-1.aaaaaaaavd6pyh743377ohug5wxn77c2tomo3fh3hslna7dx5ktpk35llt7q" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = { # forces replacement
          ~ "user_data"           = (sensitive value)
            # (1 unchanged element hidden)
        }
      ~ private_ip                          = "10.0.1.189" -> (known after apply)
      ~ public_ip                           = "152.69.167.83" -> (known after apply)
      ~ region                              = "ap-sydney-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.ap-sydney-1.aaaaaaaa3tqc6ttl4rnusucq2ojag5auvontrhqzz2vlts6kqozlggcklmya" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-02-11 07:16:48.917 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/sebvaughan97@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2026-02-11T07:16:48.566Z"
            } -> (known after apply)
          ~ freeform_tags             = {
              - "cluster"     = "k3s"
              - "environment" = "homelab"
              - "managed-by"  = "terraform"
              - "role"        = "control-plane"
              - "tier"        = "always-free"
            } -> (known after apply)
          ~ hostname_label            = "k3s-control-1-vnic" -> (known after apply)
          ~ nsg_ids                   = [] -> (known after apply)
          ~ private_ip                = "10.0.1.189" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      - instance_options {
          - are_legacy_imds_endpoints_disabled = false -> null
        }

      - launch_options {
          - boot_volume_type                    = "PARAVIRTUALIZED" -> null
          - firmware                            = "UEFI_64" -> null
          - is_consistent_volume_naming_enabled = true -> null
          - is_pv_encryption_in_transit_enabled = false -> null
          - network_type                        = "PARAVIRTUALIZED" -> null
          - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 2 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          ~ vcpus                         = 2 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (3 unchanged attributes hidden)
        }
    }

  # oci_core_instance.k3s_workers["k3s-worker-1"] must be replaced
-/+ resource "oci_core_instance" "k3s_workers" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.ap-sydney-1.abzxsljrfzaoungo656nobqm4iyouaeauy6n7nfgpqucosqyxxsysrjzcr2q" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/sebvaughan97@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2026-02-11T10:16:37.303Z"
        } -> (known after apply)
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
      ~ hostname_label                      = "k3s-worker-1-vnic" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.ap-sydney-1.anzxsljr5es2p4qcrkzuxfp6nr7vwlbmtcuttbmlylol54tihfg6bs52hz6a" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.ap-sydney-1.aaaaaaaavd6pyh743377ohug5wxn77c2tomo3fh3hslna7dx5ktpk35llt7q" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = { # forces replacement
          - "ssh_authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIK1P6kRe4cjYCx6DeWyHbTum5KhmM6yIrLqcA6t+B3c1 seb@Sebs-MacBook-Pro.local
            EOT
          - "user_data"           = (sensitive value)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.1.237" -> (known after apply)
      ~ public_ip                           = "192.9.185.189" -> (known after apply)
      ~ region                              = "ap-sydney-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.ap-sydney-1.aaaaaaaa3tqc6ttl4rnusucq2ojag5auvontrhqzz2vlts6kqozlggcklmya" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-02-11 10:16:37.749 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/sebvaughan97@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2026-02-11T10:16:37.403Z"
            } -> (known after apply)
          ~ freeform_tags             = {
              - "cluster"     = "k3s"
              - "environment" = "homelab"
              - "managed-by"  = "terraform"
              - "role"        = "worker"
              - "tier"        = "always-free"
            } -> (known after apply)
          ~ hostname_label            = "k3s-worker-1-vnic" -> (known after apply)
          ~ nsg_ids                   = [] -> (known after apply)
          ~ private_ip                = "10.0.1.237" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      - instance_options {
          - are_legacy_imds_endpoints_disabled = false -> null
        }

      - launch_options {
          - boot_volume_type                    = "PARAVIRTUALIZED" -> null
          - firmware                            = "UEFI_64" -> null
          - is_consistent_volume_naming_enabled = true -> null
          - is_pv_encryption_in_transit_enabled = false -> null
          - network_type                        = "PARAVIRTUALIZED" -> null
          - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 1 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          ~ vcpus                         = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (3 unchanged attributes hidden)
        }
    }

  # oci_core_instance.k3s_workers["k3s-worker-2"] must be replaced
-/+ resource "oci_core_instance" "k3s_workers" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.ap-sydney-1.abzxsljrxdeb4ycldrykm4yquec2sva3hzugxhr3bmfljdp24pqaao5zk63q" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/sebvaughan97@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2026-02-11T10:16:37.314Z"
        } -> (known after apply)
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-1" -> (known after apply)
      ~ hostname_label                      = "k3s-worker-2-vnic" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.ap-sydney-1.anzxsljr5es2p4qcafwj7ouns47n7fce3xxb3bxgl6qdtyufkov5z6ckk6rq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.ap-sydney-1.aaaaaaaavd6pyh743377ohug5wxn77c2tomo3fh3hslna7dx5ktpk35llt7q" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = { # forces replacement
          - "ssh_authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIK1P6kRe4cjYCx6DeWyHbTum5KhmM6yIrLqcA6t+B3c1 seb@Sebs-MacBook-Pro.local
            EOT
          - "user_data"           = (sensitive value)
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "10.0.1.48" -> (known after apply)
      ~ public_ip                           = "158.180.5.204" -> (known after apply)
      ~ region                              = "ap-sydney-1" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.ap-sydney-1.aaaaaaaa3tqc6ttl4rnusucq2ojag5auvontrhqzz2vlts6kqozlggcklmya" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-02-11 10:16:37.819 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/sebvaughan97@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2026-02-11T10:16:37.414Z"
            } -> (known after apply)
          ~ freeform_tags             = {
              - "cluster"     = "k3s"
              - "environment" = "homelab"
              - "managed-by"  = "terraform"
              - "role"        = "worker"
              - "tier"        = "always-free"
            } -> (known after apply)
          ~ hostname_label            = "k3s-worker-2-vnic" -> (known after apply)
          ~ nsg_ids                   = [] -> (known after apply)
          ~ private_ip                = "10.0.1.48" -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)
        }

      - instance_options {
          - are_legacy_imds_endpoints_disabled = false -> null
        }

      - launch_options {
          - boot_volume_type                    = "PARAVIRTUALIZED" -> null
          - firmware                            = "UEFI_64" -> null
          - is_consistent_volume_naming_enabled = true -> null
          - is_pv_encryption_in_transit_enabled = false -> null
          - network_type                        = "PARAVIRTUALIZED" -> null
          - remote_data_volume_type             = "PARAVIRTUALIZED" -> null
        }

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 1 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          ~ vcpus                         = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (3 unchanged attributes hidden)
        }
    }

  # random_password.k3s_token will be updated in-place
  ~ resource "random_password" "k3s_token" {
        id          = "none"
        # (12 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ all_nodes                    = {
      ~ k3s-control-1 = {
          ~ private_ip = "10.0.1.189" -> (known after apply)
          ~ public_ip  = "152.69.167.83" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
      ~ k3s-worker-1  = {
          ~ private_ip = "10.0.1.237" -> (known after apply)
          ~ public_ip  = "192.9.185.189" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
      ~ k3s-worker-2  = {
          ~ private_ip = "10.0.1.48" -> (known after apply)
          ~ public_ip  = "158.180.5.204" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }
  ~ k3s_control_plane_private_ip = "10.0.1.189" -> (known after apply)
  ~ k3s_control_plane_public_ip  = "152.69.167.83" -> (known after apply)
  ~ k3s_worker_private_ips       = {
      ~ k3s-worker-1 = "10.0.1.237" -> (known after apply)
      ~ k3s-worker-2 = "10.0.1.48" -> (known after apply)
    }
  ~ k3s_worker_public_ips        = {
      ~ k3s-worker-1 = "192.9.185.189" -> (known after apply)
      ~ k3s-worker-2 = "158.180.5.204" -> (known after apply)
    }
  ~ kubeconfig_command           = "ssh opc@152.69.167.83 sudo cat /etc/rancher/k3s/k3s.yaml" -> (known after apply)
  ~ ssh_commands                 = {
      ~ k3s-control-1 = "ssh opc@152.69.167.83" -> (known after apply)
      ~ k3s-worker-1  = "ssh opc@192.9.185.189" -> (known after apply)
      ~ k3s-worker-2  = "ssh opc@158.180.5.204" -> (known after apply)
    }

```

</details>

*Pusher: @bazerama, Action: `pull_request`, Workflow: `OpenTofu CI/CD`*